; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-4-2-3-6-6-3) (:domain depots)
(:objects
	depot0 depot1 depot2 depot3 - Depot
	distributor0 distributor1 - Distributor
	truck0 truck1 truck2 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 - Pallet
	crate0 crate1 crate2 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear crate2)
	(at pallet2 depot2)
	(clear crate1)
	(at pallet3 depot3)
	(clear crate0)
	(at pallet4 distributor0)
	(clear pallet4)
	(at pallet5 distributor1)
	(clear pallet5)
	(at truck0 distributor0)
	(at truck1 depot2)
	(at truck2 depot1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 depot3)
	(available hoist3)
	(at hoist4 distributor0)
	(available hoist4)
	(at hoist5 distributor1)
	(available hoist5)
	(at crate0 depot3)
	(on crate0 pallet3)
	(at crate1 depot2)
	(on crate1 pallet2)
	(at crate2 depot1)
	(on crate2 pallet1)
)

(:goal (and
		(on crate0 crate1)
		(on crate1 pallet4)
		(on crate2 pallet2)
	)
))

; plan
1. (lift hoist2 crate1 pallet2 depot2)
   deleted: (at crate1 depot2) (available hoist2) (on crate1 pallet2) (clear crate1)
   added: (lifting hoist2 crate1) (clear pallet2)
   goals met: 0 of 3
2. (load hoist2 crate1 truck1 depot2)
   deleted: (lifting hoist2 crate1)
   added: (in crate1 truck1) (available hoist2)
   goals met: 0 of 3
3. (lift hoist1 crate2 pallet1 depot1)
   deleted: (at crate2 depot1) (available hoist1) (on crate2 pallet1) (clear crate2)
   added: (lifting hoist1 crate2) (clear pallet1)
   goals met: 0 of 3
4. (load hoist1 crate2 truck2 depot1)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck2) (available hoist1)
   goals met: 0 of 3
5. (drive truck2 depot1 depot2)
   deleted: (at truck2 depot1)
   added: (at truck2 depot2)
   goals met: 0 of 3
6. (unload hoist2 crate2 truck2 depot2)
   deleted: (available hoist2) (in crate2 truck2)
   added: (lifting hoist2 crate2)
   goals met: 0 of 3
7. (lift hoist3 crate0 pallet3 depot3)
   deleted: (at crate0 depot3) (available hoist3) (on crate0 pallet3) (clear crate0)
   added: (lifting hoist3 crate0) (clear pallet3)
   goals met: 0 of 3
8. (drive truck1 depot2 depot3)
   deleted: (at truck1 depot2)
   added: (at truck1 depot3)
   goals met: 0 of 3
9. (load hoist3 crate0 truck1 depot3)
   deleted: (lifting hoist3 crate0)
   added: (in crate0 truck1) (available hoist3)
   goals met: 0 of 3
10. (drive truck1 depot3 distributor0)
   deleted: (at truck1 depot3)
   added: (at truck1 distributor0)
   goals met: 0 of 3
11. (drop hoist2 crate2 pallet2 depot2)
   deleted: (lifting hoist2 crate2) (clear pallet2)
   added: (at crate2 depot2) (available hoist2) (on crate2 pallet2) (clear crate2)
   goals met: 1 of 3
12. (unload hoist4 crate1 truck1 distributor0)
   deleted: (available hoist4) (in crate1 truck1)
   added: (lifting hoist4 crate1)
   goals met: 1 of 3
13. (drop hoist4 crate1 pallet4 distributor0)
   deleted: (lifting hoist4 crate1) (clear pallet4)
   added: (at crate1 distributor0) (available hoist4) (on crate1 pallet4) (clear crate1)
   goals met: 2 of 3
14. (unload hoist4 crate0 truck1 distributor0)
   deleted: (available hoist4) (in crate0 truck1)
   added: (lifting hoist4 crate0)
   goals met: 2 of 3
15. (drop hoist4 crate0 crate1 distributor0)
   deleted: (lifting hoist4 crate0) (clear crate1)
   added: (at crate0 distributor0) (available hoist4) (on crate0 crate1) (clear crate0)
   goals met: 3 of 3
